## Titanic analysis

In [1]:
import pandas as pd

In [32]:
train = pd.read_csv('./data/train.csv')

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
print('Training set Rows : ')
print(train.shape[0])
print('Columns : ')
print(train.shape[1])

Training set Rows :
891
Columns :
12

In [5]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

### Following are missing values

* Age
* Cabin
* Embarked

### Fill nulls in Age

In [10]:
train['Age'].fillna(train['Age'].mean(), inplace = True)

In [11]:
train_describe_numeric = train.describe()
train_describe_numeric

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,13.002015,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,29.699118,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [12]:
print('So survival rate is ')
print(train_describe_numeric.loc['mean', 'Survived'])

So survival rate is
0.383838383838

In [14]:
train_describe_categorical = train.describe(include=['O'])
train_describe_categorical

                             Name   Sex  Ticket Cabin Embarked
count                         891   891     891   204      889
unique                        891     2     681   147        3
top     Smith, Miss. Marion Elsie  male  347082    G6        S
freq                            1   577       7     4      644

### Find family size

In [19]:
train["Family_Size"] = train['SibSp'] + train['Parch'] + 1
train["Family_Size"].head()

0    2
1    2
2    1
3    2
4    1
Name: Family_Size, dtype: int64

### Create family category

In [22]:
# introducing other features based on the family size
train[ 'Family_Single' ] = train[ 'Family_Size' ].map( lambda s : 1 if s == 1 else 0 )
train[ 'Family_Small' ] = train[ 'Family_Size' ].map( lambda s : 1 if 2 <= s <= 4 else 0 )
train[ 'Family_Large' ] = train[ 'Family_Size' ].map( lambda s : 1 if 5 <= s else 0 )

In [24]:
train.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_Size,Family_Single,Family_Small,Family_Large
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,0,1,0

### Convert Sex to 1/0

In [33]:
train[ 'Sex' ] = train[ 'Sex' ].map( lambda s : 1 if s == 'male' else 0 )
train[ 'Sex' ]

AttributeError: 'str' object has no attribute 'equals'

### Survival rate by class

In [16]:
survival_rate_by_class = train[['Pclass', 'Survived']].groupby(['Pclass'], as_index = False).mean()
survival_rate_by_class = survival_rate_by_class.sort_values(by = 'Survived', ascending = False)
survival_rate_by_class

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

The upper class had a much higher chance of surviving the disaster

### Survival rate by gender

In [17]:
survival_rate_by_gender = train[["Sex", "Survived"]].groupby(['Sex'], as_index = False).mean()
survival_rate_by_gender = survival_rate_by_gender.sort_values(by = 'Survived', ascending = False)
survival_rate_by_gender

      Sex  Survived
0  female  0.742038
1    male  0.188908

Women were much more likely to survive

### Survival rate by family size

In [18]:
survival_rate_by_family_size = train[["Family_Size", "Survived"]].groupby(['Family_Size'], as_index = False).mean()
survival_rate_by_family_size = survival_rate_by_family_size.sort_values(by = 'Survived', ascending = False)
survival_rate_by_family_size

   Family_Size  Survived
3            3  0.724138
2            2  0.578431
1            1  0.552795
6            6  0.333333
0            0  0.303538
4            4  0.200000
5            5  0.136364
7            7  0.000000
8           10  0.000000

In [35]:
blue = train["Family_Size"]

In [36]:
store blue

Stored 'blue' (Series)